airline1.2/app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT `flights`.* FROM `flights`

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO `flights` (`destination`, `time`, `date`, `placesBus`, `placesStan`, `priceBus`, `priceStan`, `priceLag`, `pricePriv`, `created_at`, `updated_at`) VALUES ('', '2017-11-26 01:20:00', '2021-04-26', 12, 34, 45, 7, 12, 56, '2017-11-26 15:37:28', '2017-11-26 15:37:28')

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE `flights` SET `destination` = 'Khalover', `updated_at` = '2017-11-27 16:49:13' WHERE `flights`.`id` = 1

    def set_flight
      @flight = Flight.find(params[:id])
---
SELECT  `flights`.* FROM `flights` WHERE `flights`.`id` = 2 LIMIT 1