airline1.2/app/controllers/orders_controller.rb

  def create
    @flight = Flight.find(params[:flight_id])
    mess = "everuthing is ok"
    Flight.transaction do
      Order.transaction do
        if params[:order][:category] == "1"
        then  if @flight.placesBus <= 0 then

                mess ="some error has occured"
                raise ActiveRecord::Rollback

              end
        else  if @flight.placesStan <= 0 then
                mess ="some error has occured"
                raise ActiveRecord::Rollback
              end
        end
      order = @flight.orders.create(order_params)
---
SELECT  `flights`.* FROM `flights` WHERE `flights`.`id` = 1 LIMIT 1
INSERT INTO `orders` (`name`, `surname`, `passport`, `hasLag`, `hasPriv`, `category`, `flight_id`, `created_at`, `updated_at`) VALUES ('knlknl', '.m.m.,', 'mmmm', 1, 1, 1, 1, '2017-11-26 16:00:53', '2017-11-26 16:00:53')


              end
        end
        @flight.save
---
UPDATE `flights` SET `placesStan` = 0, `updated_at` = '2017-11-26 19:04:43' WHERE `flights`.`id` = 2