airline1.2/app/views/flights/show.html.erb

<h2>make an order</h2>
<%= form_for([@flight,@flight.orders.build]) do |f|%>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`flight_id` = 1